---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentEntryPoint..::..ShowElements Method
DocumentEntryPoint Class See Also Send Feedback
---

Shows one or more elements by zoom to fit.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ShowElements(Element) | Shows the element by zoom to fit. (Inherited from UIDocument.) |
|  | ShowElements(ElementId) | Shows the element by zoom to fit. (Inherited from UIDocument.) |
|  | ShowElements(ICollection<(Of <<'(ElementId>)>>)) | Shows the elements by zoom to fit. (Inherited from UIDocument.) |
|  | ShowElements(ElementSet) | Shows the elements by zoom to fit. (Inherited from UIDocument.) |

# See Also

DocumentEntryPoint Class

DocumentEntryPoint Members

Autodesk.Revit.UI.Macros Namespace